================================================================================
Matrix Indexing: Simple
================================================================================

A(1)
A(1, 2)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (number)))
  (function_call
    (identifier)
    (arguments
      (number)
      (number))))

================================================================================
Matrix Indexing: Spread Operator
================================================================================

A(:)
A(1, :)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (spread_operator)))
  (function_call
    (identifier)
    (arguments
      (number)
      (spread_operator))))

================================================================================
Cell Indexing: Simple
================================================================================

A{1}
A{1, 2}

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (number)))
  (function_call
    (identifier)
    (arguments
      (number)
      (number))))

================================================================================
Cell Indexing: Spread Operator
================================================================================

A{:}
A{1, :}

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (spread_operator)))
  (function_call
    (identifier)
    (arguments
      (number)
      (spread_operator))))
