================================================================================
Matrix: Simple
================================================================================

[1 2 3 4]
[1,2,3,4]

--------------------------------------------------------------------------------

(source_file
  (matrix_definition
    (row
      (number)
      (number)
      (number)
      (number)))
  (matrix_definition
    (row
      (number)
      (number)
      (number)
      (number))))

================================================================================
Matrix: Multidimensional
================================================================================

[1, 2; 3, 4]
[1, 2; 3 4]

--------------------------------------------------------------------------------

(source_file
  (matrix_definition
    (row
      (number)
      (number))
    (row
      (number)
      (number)))
  (matrix_definition
    (row
      (number)
      (number))
    (row
      (number)
      (number))))

================================================================================
Matrix: Concatenation
================================================================================

[A-L*C [L B]; I 0]

[A- L*C [L B]
 I      0    ]

--------------------------------------------------------------------------------

(source_file
  (matrix_definition
    (row
      (binary_operator
        (identifier)
        (binary_operator
          (identifier)
          (identifier)))
      (matrix_definition
        (row
          (identifier)
          (identifier))))
    (row
      (identifier)
      (number)))
  (matrix_definition
    (row
      (binary_operator
        (identifier)
        (binary_operator
          (identifier)
          (identifier)))
      (matrix_definition
        (row
          (identifier)
          (identifier))))
    (row
      (identifier)
      (number))))

================================================================================
Matrix: Multiline
================================================================================

[1 2
 3 4]

--------------------------------------------------------------------------------

(source_file
  (matrix_definition
    (row
      (number)
      (number))
    (row
      (number)
      (number))))
